content/autobiography/chronological.org
#+startup: content indent

[[file:../index.org][Giovanni's Diary]] >

* Chronological Order
#+INDEX: Giovanni's Diary!Autobiography

You choose to explore the diary chronologically. This is a good way to
get to know me and understand how I ended up doing what I do.

However, if you are less interested about my background and more
curious to read the cool things that I do now, you can always go to
the [[file:../subjects.org][subjects]] page.

Since I have started this website, I keep a daily diary called
[[file:../ephemeris/ephemeris.org][ephemeris]]. I also maintain a [[file:../news.org][what's new]] page where I list new pages as
I write them, and a [[file:../changelog.org][changelog]] listing all the changes.

For all the rest, [[file:early-life.org][let's go back a few years]].

-----

Travel: [[file:../first-page.html][First Page]], [[file:../theindex.org][Index]]
