public/autobiography/chronological.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt;
</p>
<div id="outline-container-orgf68a4ec" class="outline-2">
<h2 id="orgf68a4ec">Chronological Order</h2>
<div class="outline-text-2" id="text-orgf68a4ec">
<p>
You choose to explore the diary chronologically. This is a good way to
get to know me and understand how I ended up doing what I do.
</p>

<p>
However, if you are less interested about my background and more
curious to read the cool things that I do now, you can always go to
the <a href="../subjects.html">subjects</a> page.
</p>

<p>
Since I have started this website, I keep a daily diary called
<a href="../ephemeris/ephemeris.html">ephemeris</a>. I also maintain a <a href="../news.html">what's new</a> page where I list new pages as
I write them, and a <a href="../changelog.html">changelog</a> listing all the changes.
</p>

<p>
For all the rest, <a href="early-life.html">let's go back a few years</a>.
</p>

<hr />

<p>
Travel: <a href="../first-page.html">First Page</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
